HasSpatialElementFromToCalculationPoints Property
 Identifies if this instance has a pair of SpatialElementCalculationPoints used as the search points for Revit to identify if the instance lies between up to two rooms or spaces.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2016
 Syntax
  C#
public bool HasSpatialElementFromToCalculationPoints { get; }
  Visual Basic
Public ReadOnly Property HasSpatialElementFromToCalculationPoints As Boolean
	Get
  Visual C++
public:
property bool HasSpatialElementFromToCalculationPoints {
	bool get ();
}
 Return Value
 True if this instance has a pair of SpatialElementCalculationPoints used as the search points, false otherwise.
 Remarks
 The points determine which room or space is considered the "from" and which is considered the "to" for a family instance which connects two rooms or spaces, such as a door or window.
 See Also
  FamilyInstance Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →